Значение выражения 36^8 + 6^20 − 12? записали в системе счисления с основанием 6.
Сколько цифр 5 содержится в этой записи?


Решение:
    
    1)36^8 = 6^2^8 = 6^16 
    2)6^16 - 6 * 2 (в системе счисления с основанием 6 будет выглядеть как четырнадцать пятёрок, четвёрка и один ноль)
    3)6^20(в 6сс одна 1 и 20 нулей)

Ответ: 14 пятёрок.    




x = 4**255 + 2**255 - 255
k=0
while x > 0:
  if x % 2 == 1:
    k+=1
  x = x//2
print(k)
//количество единиц в двоичной записи
